<!-- add-pr-comment:dev-tfplan -->

Terraform plan output for dev

```text


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.aurora.aws_ssm_parameter.this["/nat-gateway/poc/training/cluster_endpoint"] will be updated in-place
  ~ resource "aws_ssm_parameter" "this" {
        id              = "/nat-gateway/poc/training/cluster_endpoint"
      + insecure_value  = (known after apply)
        name            = "/nat-gateway/poc/training/cluster_endpoint"
        tags            = {
            "AuroraName"   = "nat-gateway-poc-db-cluster-ssm-param"
            "Environment"  = "poc"
            "MonoRepo"     = "True"
            "MonoRepoPath" = "terraform/db"
            "Project"      = "arc-training-saurav"
        }
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.aurora.module.aurora_cluster[0].aws_rds_cluster.primary[0] will be created
  + resource "aws_rds_cluster" "primary" {
      + allocated_storage                   = (known after apply)
      + allow_major_version_upgrade         = false
      + apply_immediately                   = true
      + arn                                 = (known after apply)
      + availability_zones                  = (known after apply)
      + backtrack_window                    = 0
      + backup_retention_period             = 5
      + cluster_identifier                  = "nat-gateway-poc-training"
      + cluster_identifier_prefix           = (known after apply)
      + cluster_members                     = (known after apply)
      + cluster_resource_id                 = (known after apply)
      + copy_tags_to_snapshot               = true
      + database_name                       = "training"
      + db_cluster_parameter_group_name     = "nat-gateway-poc-training-20240719214216420700000001"
      + db_subnet_group_name                = "nat-gateway-poc-training"
      + deletion_protection                 = false
      + enable_global_write_forwarding      = false
      + enable_http_endpoint                = false
      + endpoint                            = (known after apply)
      + engine                              = "aurora-postgresql"
      + engine_mode                         = "provisioned"
      + engine_version                      = "14.5"
      + engine_version_actual               = (known after apply)
      + final_snapshot_identifier           = "nat-gateway-poc-training"
      + hosted_zone_id                      = (known after apply)
      + iam_database_authentication_enabled = false
      + iam_roles                           = (known after apply)
      + id                                  = (known after apply)
      + kms_key_id                          = (known after apply)
      + master_password                     = (sensitive value)
      + master_user_secret                  = (known after apply)
      + master_user_secret_kms_key_id       = (known after apply)
      + master_username                     = "db_admin"
      + network_type                        = (known after apply)
      + port                                = (known after apply)
      + preferred_backup_window             = "07:00-09:00"
      + preferred_maintenance_window        = "wed:03:00-wed:04:00"
      + reader_endpoint                     = (known after apply)
      + skip_final_snapshot                 = true
      + storage_encrypted                   = true
      + storage_type                        = (known after apply)
      + tags                                = {
          + "Environment"  = "poc"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/db"
          + "Name"         = "training"
          + "Namespace"    = "nat-gateway"
          + "Project"      = "arc-training-saurav"
          + "Stage"        = "poc"
        }
      + tags_all                            = {
          + "Environment"  = "poc"
          + "MonoRepo"     = "True"
          + "MonoRepoPath" = "terraform/db"
          + "Name"         = "training"
          + "Namespace"    = "nat-gateway"
          + "Project"      = "arc-training-saurav"
          + "Stage"        = "poc"
        }
      + vpc_security_group_ids              = [
          + "sg-06983ad5f8c3410da",
        ]
        # (2 unchanged attributes hidden)

      + serverlessv2_scaling_configuration {
          + max_capacity = 16
          + min_capacity = 2
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```

